---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementBoundaryOptions.StoreFreeBoundaryFaces
source: html/376cfb45-7000-a074-9867-bb720f3db84d.htm
---
# Autodesk.Revit.DB.SpatialElementBoundaryOptions.StoreFreeBoundaryFaces Property

Indicates whether to include the free boundary faces in the result.

## Syntax (C#)
```csharp
public bool StoreFreeBoundaryFaces { get; set; }
```

## Remarks
A free subface is a portion of a spatial element face that is not (partially) coincident with a face of a bounding element.